# Pandas
1. Series : 1차원 Vector + 명시적 index
2. DataFrame : 2차원 Matrix + 명시적 index

### Series

In [227]:
import numpy as np
import pandas as pd

In [228]:
L = [1,2,3,5]
pd.Series(L)   # index를 명시하지 않으면 0 부터 자동으로 index가 생성..

0    1
1    2
2    3
3    5
dtype: int64

In [229]:
L = [1,2,3,5]
pd.Series(L, index=['a','b','c','d'])   # index를 지정하면 지정된 인덱스로 생성..

a    1
b    2
c    3
d    5
dtype: int64

In [230]:
L = {'a':1, 'b':2, 'c':3, 'd':4}
pd.Series(L)       # dict의 경우 series로 만들면, key가 index가 된다..

a    1
b    2
c    3
d    4
dtype: int64

In [231]:
L = {'a':1, 'b':2, 'c':3, 'd':4}
S = pd.Series(L, index = ['a','b','c','d','e','f','g'])       # dict의 경우 series로 만들면, key가 index가 된다..

In [232]:
S['c']

3.0

In [233]:
S['g'] =100
S

a      1.0
b      2.0
c      3.0
d      4.0
e      NaN
f      NaN
g    100.0
dtype: float64

In [234]:
S.index

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g'], dtype='object')

In [235]:
S.values

array([  1.,   2.,   3.,   4.,  nan,  nan, 100.])

### DataFrame

In [236]:
raw_data = {
    'first_name':['jason','molly','tina','jake','any'],
    'last_name':['miller','jacobson','ali','milner','cooze'],
    'age':[42,52,36,24,75],
    'city':['san francisco','baltimore','miami','douglas','boston']
}

raw_data

{'first_name': ['jason', 'molly', 'tina', 'jake', 'any'],
 'last_name': ['miller', 'jacobson', 'ali', 'milner', 'cooze'],
 'age': [42, 52, 36, 24, 75],
 'city': ['san francisco', 'baltimore', 'miami', 'douglas', 'boston']}

In [237]:
df = pd.DataFrame(raw_data)
df

  first_name last_name  age           city
0      jason    miller   42  san francisco
1      molly  jacobson   52      baltimore
2       tina       ali   36          miami
3       jake    milner   24        douglas
4        any     cooze   75         boston

In [238]:
pd.DataFrame(raw_data, columns = ['last_name','first_name'])

  last_name first_name
0    miller      jason
1  jacobson      molly
2       ali       tina
3    milner       jake
4     cooze        any

In [239]:
df = pd.DataFrame(raw_data)
df

  first_name last_name  age           city
0      jason    miller   42  san francisco
1      molly  jacobson   52      baltimore
2       tina       ali   36          miami
3       jake    milner   24        douglas
4        any     cooze   75         boston

In [240]:
# 칼럼 선택

In [241]:
df['first_name']   # 칼럼명을로 칼럼선택

0    jason
1    molly
2     tina
3     jake
4      any
Name: first_name, dtype: object

In [242]:
df[['age','city']]

   age           city
0   42  san francisco
1   52      baltimore
2   36          miami
3   24        douglas
4   75         boston

In [243]:
df

  first_name last_name  age           city
0      jason    miller   42  san francisco
1      molly  jacobson   52      baltimore
2       tina       ali   36          miami
3       jake    milner   24        douglas
4        any     cooze   75         boston

In [244]:
df.index = ['a','b','c','d','e']
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [245]:
df.loc['e']

first_name       any
last_name      cooze
age               75
city          boston
Name: e, dtype: object

In [246]:
df.iloc[2]

first_name     tina
last_name       ali
age              36
city          miami
Name: c, dtype: object

In [247]:
# df['칼럼명'] => 해당 칼럼을 출력

# df.loc['인덱스명'] => 해당 row를 선택
# df.iloc[row번호] => 해당 row 선택

# df.loc['인덱스명', '칼럼명']
# df.iloc[인덱스번호, 칼럼번호]

In [248]:
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [249]:
df.loc[['b','c']]

  first_name last_name  age       city
b      molly  jacobson   52  baltimore
c       tina       ali   36      miami

In [250]:
df.iloc[[1,2]]

  first_name last_name  age       city
b      molly  jacobson   52  baltimore
c       tina       ali   36      miami

In [251]:
df.loc[['b','c','d'], ['last_name','age']]

  last_name  age
b  jacobson   52
c       ali   36
d    milner   24

In [252]:
df.iloc[[1,2,3], [1,2]]

  last_name  age
b  jacobson   52
c       ali   36
d    milner   24

In [253]:
df.iloc[1:3, [1,2]]

  last_name  age
b  jacobson   52
c       ali   36

In [254]:
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [255]:
df.iloc[1:4, 1:3]

  last_name  age
b  jacobson   52
c       ali   36
d    milner   24

In [256]:
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [257]:
df.loc[:, 'first_name': 'age']

  first_name last_name  age
a      jason    miller   42
b      molly  jacobson   52
c       tina       ali   36
d       jake    milner   24
e        any     cooze   75

In [258]:
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [259]:
df.loc[['a','b'], ['last_name', 'age']]

  last_name  age
a    miller   42
b  jacobson   52

In [260]:
df.loc[['a','b'], ['first_name', 'age']]

  first_name  age
a      jason   42
b      molly   52

In [261]:
df.iloc[[0,1],[0,1]]

  first_name last_name
a      jason    miller
b      molly  jacobson

In [262]:
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [263]:
df.loc[['b','c'], ['last_name', 'age','city']]

  last_name  age       city
b  jacobson   52  baltimore
c       ali   36      miami

In [264]:
df.iloc[[1,2],[1,2,3]]

  last_name  age       city
b  jacobson   52  baltimore
c       ali   36      miami

In [265]:
df.iloc[[1,2],1:3]

  last_name  age
b  jacobson   52
c       ali   36

In [266]:
df.loc[['b','c'], 'first_name':'age']

  first_name last_name  age
b      molly  jacobson   52
c       tina       ali   36

In [267]:
df.loc[:, 'first_name':'age']

  first_name last_name  age
a      jason    miller   42
b      molly  jacobson   52
c       tina       ali   36
d       jake    milner   24
e        any     cooze   75

In [268]:
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [269]:
df['age']

a    42
b    52
c    36
d    24
e    75
Name: age, dtype: int64

In [270]:
df['age'] > 40

a     True
b     True
c    False
d    False
e     True
Name: age, dtype: bool

In [271]:
df.loc[df['age'] > 40]

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
e        any     cooze   75         boston

In [272]:
df['city'] == 'miami'

a    False
b    False
c     True
d    False
e    False
Name: city, dtype: bool

In [273]:
df.loc[df['city'] == 'miami']

  first_name last_name  age   city
c       tina       ali   36  miami

In [274]:
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [275]:
# 'ali'의 나이는?

In [276]:
df.last_name == 'ali'

a    False
b    False
c     True
d    False
e    False
Name: last_name, dtype: bool

In [277]:
df[df.last_name == 'ali'].age

c    36
Name: age, dtype: int64

In [278]:
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [279]:
df.T  # transpose : 행과 열의 전환..

                        a          b      c        d       e
first_name          jason      molly   tina     jake     any
last_name          miller   jacobson    ali   milner   cooze
age                    42         52     36       24      75
city        san francisco  baltimore  miami  douglas  boston

In [280]:
df.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [281]:
df.columns

Index(['first_name', 'last_name', 'age', 'city'], dtype='object')

In [282]:
df.to_csv('test_df.csv')

In [283]:
pwd

'D:\\fun\\pandas'

In [284]:
df.head(3)

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami

In [285]:
df.tail(2)

  first_name last_name  age     city
d       jake    milner   24  douglas
e        any     cooze   75   boston

In [286]:
del df['age']

In [287]:
df

  first_name last_name           city
a      jason    miller  san francisco
b      molly  jacobson      baltimore
c       tina       ali          miami
d       jake    milner        douglas
e        any     cooze         boston

In [288]:
df.drop('a')

  first_name last_name       city
b      molly  jacobson  baltimore
c       tina       ali      miami
d       jake    milner    douglas
e        any     cooze     boston

In [289]:
df.drop('city', axis=1)

  first_name last_name
a      jason    miller
b      molly  jacobson
c       tina       ali
d       jake    milner
e        any     cooze

In [290]:
del df

In [291]:
df

NameError: name 'df' is not defined

In [ ]:
df = pd.read_csv('test_df.csv')
df

In [ ]:
# apply

In [ ]:
# age칼럼의 값을 한국나이로 전환.. => +1

In [ ]:
kage = []
for a in df.age:
    kage.append(a+1)
kage

In [ ]:
def kage(a):
    return a+1

In [ ]:
df['age'].apply(kage)

In [ ]:
df['age'].apply(lambda x: x+1)

In [ ]:
df['Job'] = ['teacher', 'driver','doctor','cook','engineer']
df

In [ ]:
df['age'] = df['age'].apply(lambda x: x+1)
df

In [ ]:
arr = np.array([[1,2,4,5],[4,5,6,7],[5,6,7,8]])
arr

In [ ]:
df = pd.DataFrame(arr)
df.sum(axis=1)  # 가로방향

In [ ]:
df.max(axis=0)  # 세로방향

In [292]:
df

NameError: name 'df' is not defined

In [293]:
df.drop(0, axis=1)  # 삭제명령 : axis=1 => 세로/  axis=0 => 가로

NameError: name 'df' is not defined

In [294]:
wages = pd.read_csv('wages.csv')
wages.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [295]:
wages['height'].apply(lambda x: int(x))

0       73
1       66
2       63
3       63
4       63
        ..
1374    71
1375    61
1376    63
1377    71
1378    68
Name: height, Length: 1379, dtype: int64

In [312]:
wages.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1379 entries, 0 to 1378
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   earn    1379 non-null   float64
 1   height  1379 non-null   float64
 2   sex     1379 non-null   object
 3   race    1379 non-null   object
 4   ed      1379 non-null   int64
 5   age     1379 non-null   int64
dtypes: float64(2), int64(2), object(2)
memory usage: 64.8+ KB

In [313]:
wages.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [314]:
wages.race.unique()

array(['white', 'other', 'hispanic', 'black'], dtype=object)

In [315]:
race_dict = dict(enumerate(wages.race.unique()))
race_dict

{0: 'white', 1: 'other', 2: 'hispanic', 3: 'black'}

In [304]:
new_dict = {}
for i in race_dict.items():
    new_dict[i[1]] = i[0]
new_dict

{'white': 0, 'other': 1, 'hispanic': 2, 'black': 3}

In [305]:
wages['race'].map(new_dict)

0       0
1       0
2       0
3       1
4       0
       ..
1374    0
1375    0
1376    0
1377    0
1378    0
Name: race, Length: 1379, dtype: int64

In [306]:
race_dict

{0: 'white', 1: 'other', 2: 'hispanic', 3: 'black'}

In [307]:
key = race_dict.keys()
values = race_dict.values()

In [308]:
key

dict_keys([0, 1, 2, 3])

In [309]:
wages['race'].replace(to_replace = values, value =key)

0       0
1       0
2       0
3       1
4       0
       ..
1374    0
1375    0
1376    0
1377    0
1378    0
Name: race, Length: 1379, dtype: int64

In [318]:
wages

              earn  height     sex   race  ed  age
0     79571.299011   73.89    male  white  16   49
1     96396.988643   66.23  female  white  16   62
2     48710.666947   63.77  female  white  16   33
3     80478.096153   63.22  female  other  16   95
4     82089.345498   63.08  female  white  17   43
...            ...     ...     ...    ...  ..  ...
1374  30173.380363   71.68    male  white  12   33
1375  24853.519514   61.31  female  white  18   86
1376  13710.671312   63.64  female  white  12   37
1377  95426.014410   71.65    male  white  12   54
1378   9575.461857   68.22    male  white  12   31

[1379 rows x 6 columns]

In [310]:
### Groupby
# => 동일 종류의 데이터 끼리 묶어서 처리..
# => df['칼럼'].['칼럼'].연산함수...

In [319]:
wages.groupby('sex')['earn'].mean()

# groupby 이중구조..
# 1. data grouping : wages.groupby('sex')
# 2. group별 값을 계산 => ['earn'].mean()

sex
female    24245.647877
male      45993.126922
Name: earn, dtype: float64

In [320]:
# 인종별 평균 교육연수
wages.groupby('race')['ed'].mean()

race
black       13.039683
hispanic    12.987013
other       13.965517
white       13.398431
Name: ed, dtype: float64

In [334]:
data = {'Team':['Riders','Riders','Devils', 'Devils','Kings','Giant', 'Kings',\
               'Kings','Riders','Royals','Royals', 'Riders'],
       'Rank':[1,2,2,3,3,4,1,1,2,4,1,2],
       'Year':[2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
       'Points':[876,788,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(data)

In [335]:
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     788
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    Giant     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [336]:
# 팀별 최고 성적순은?

df.groupby('Team')['Rank'].min()

Team
Devils    2
Giant     4
Kings     1
Riders    1
Royals    1
Name: Rank, dtype: int64

In [338]:
# 연도별 최고 득점
df.groupby('Year')['Points'].max()

Year
2014    876
2015    812
2016    756
2017    788
Name: Points, dtype: int64

### grouped 객체

In [339]:
grouped = df.groupby('Team')

In [340]:
grouped.get_group('Kings')

    Team  Rank  Year  Points
4  Kings     3  2014     741
6  Kings     1  2016     756
7  Kings     1  2017     788

In [342]:
grouped.get_group('Royals')

      Team  Rank  Year  Points
9   Royals     4  2014     701
10  Royals     1  2015     804

In [343]:
grouped.min()

        Rank  Year  Points
Team
Devils     2  2014     673
Giant      4  2015     812
Kings      1  2014     741
Riders     1  2014     690
Royals     1  2014     701

In [344]:
grouped.mean()

            Rank         Year      Points
Team
Devils  2.500000  2014.500000  768.000000
Giant   4.000000  2015.000000  812.000000
Kings   1.666667  2015.666667  761.666667
Riders  1.750000  2015.500000  762.000000
Royals  2.500000  2014.500000  752.500000

In [345]:
grouped['Points'].mean()

Team
Devils    768.000000
Giant     812.000000
Kings     761.666667
Riders    762.000000
Royals    752.500000
Name: Points, dtype: float64

In [347]:
grouped[['Rank','Points']].agg([np.sum, np.mean, np.std])

       Rank                     Points
        sum      mean       std    sum        mean         std
Team
Devils    5  2.500000  0.707107   1536  768.000000  134.350288
Giant     4  4.000000       NaN    812  812.000000         NaN
Kings     5  1.666667  1.154701   2285  761.666667   24.006943
Riders    7  1.750000  0.500000   3048  762.000000   88.468450
Royals    5  2.500000  2.121320   1505  752.500000   72.831998

In [348]:
# df.groupby('Team')['Point'].mean()
# =>
grouped = df.groupby('Team')
grouped['Points'].agg(np.mean)

Team
Devils    768.000000
Giant     812.000000
Kings     761.666667
Riders    762.000000
Royals    752.500000
Name: Points, dtype: float64